app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "published_date", "created_at", "updated_at", "Total_book", "Current_book") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save