app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY name ASC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
  def index
   if params[:search].present?
      @users=User.where("name like '%#{params[:search]}%'").paginate(page: params[:page], per_page: 5).order('name ASC')
    else
      @users=User.all.paginate(page: params[:page], per_page: 5).order('name ASC')

SELECT "books".* FROM "books" INNER JOIN "book_users" ON "books"."id" = "book_users"."book_id" WHERE "book_users"."user_id" = ?  [["user_id", 980190962]]
---
  def destroy
    @books=@user.books
    @books.each do |bookdb|